org/writing.org
# -*- eval: (org-hugo-auto-export-mode 1); -*-
#+hugo_base_dir: ../
#+hugo_section: /
#+hugo_front_matter_format: yaml
#+STARTUP: logdone
#+PROPERTY: header-args:R :session *R* :exports both :colnames yes :eval never-export :results value

* Films
:PROPERTIES:
:EXPORT_HUGO_SECTION: /
:EXPORT_FILE_NAME: films
:END:
I have over a decade of experience with various artistic media such as
film, music, and writing.

** Filmography
*** Documentary Films
+ [[http://www.viddler.com/v/6805fb13][The People's House]] (2015)
  [fn:ph]
+ [[http://www.viddler.com/v/3e83e938][Due Process]] (2014) [fn:dp]
+ Cary (2013) [fn:cary]
+ Executive Powers (2013)
+ [[https://www.youtube.com/watch?v=c_SvgFo71x0][Intellectual Property]] (2012) [fn:ip]
+ [[https://www.c-span.org/video/?298275-27/the-great-compromise][The Great Compromise]]
  (2011) [fn:gc]
+ [[https://www.c-span.org/video/?292400-17/wasting-waste][Wasting  Waste]]
  (2010) [fn:ww]

***  Web Series
- *Filmmakers' Guide* :: Ran for the course of a year from 2012 to 2013. Reached over a thousand subscribers and over a hundred thousand views.
- *The Hitchhikers* :: Created a documentary series as marketing tool for Hitchhikers
  Robotics Group, Inc between 2012 and 2015.  Reached over fifteen
  thousand views.
**** Press
- [[https://www.newsobserver.com/news/local/community/cary-news/article22811496.html]["Cary teen wins fifth C-SPAN video award"]] :: Will Doran, The Cary News. 1 June 2015.
- "Cary teen's documentary tops contest" :: Andrew Kenney, The Cary News. 30 March 2011.


[fn:ph]: Honorable Mention, StudentCam 2015

[fn:dp]: Honorable Mention, StudentCam 2014

[fn:ip]: First Prize (High School), StudentCam 2012

[fn:gc]: Grand Prize, StudentCam 2011

[fn:ww]: Third Prize, StudentCam 2010

[fn:cary]: Paul Green Multimedia Award recipient (North Carolina Society
of Historians)
