content/films.md
---
title: "Films"
draft: false
---

I have over a decade of experience with various artistic media such as
film, music, and writing.


## Filmography {#filmography}


### Documentary Films {#documentary-films}

-   [The People's House](http://www.viddler.com/v/6805fb13) (2015)
    [^fn:1]
-   [Due Process](http://www.viddler.com/v/3e83e938) (2014)&nbsp;[^fn:2]
-   Cary (2013)&nbsp;[^fn:3]
-   Executive Powers (2013)
-   [Intellectual Property](https://www.youtube.com/watch?v=c%5FSvgFo71x0) (2012)&nbsp;[^fn:4]
-   [The Great Compromise](https://www.c-span.org/video/?298275-27/the-great-compromise)
    (2011)&nbsp;[^fn:5]
-   [Wasting  Waste](https://www.c-span.org/video/?292400-17/wasting-waste)
    (2010)&nbsp;[^fn:6]


### Web Series {#web-series}

**Filmmakers' Guide**
: Ran for the course of a year from 2012 to 2013. Reached over a thousand subscribers and over a hundred thousand views.

**The Hitchhikers**
: Created a documentary series as marketing tool for Hitchhikers
    Robotics Group, Inc between 2012 and 2015.  Reached over fifteen
    thousand views.


#### Press {#press}

["Cary teen wins fifth C-SPAN video award"](https://www.newsobserver.com/news/local/community/cary-news/article22811496.html)
: Will Doran, The Cary News. 1 June 2015.

"Cary teen's documentary tops contest"
: Andrew Kenney, The Cary News. 30 March 2011.

[^fn:1]: : Honorable Mention, StudentCam 2015
[^fn:2]: : Honorable Mention, StudentCam 2014
[^fn:3]: : Paul Green Multimedia Award recipient (North Carolina Society of Historians)
[^fn:4]: : First Prize (High School), StudentCam 2012
[^fn:5]: : Grand Prize, StudentCam 2011
[^fn:6]: : Third Prize, StudentCam 2010
